base_case/system/blockMeshDict



FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (0.05 0.0 -0.005) // 0
    (0.05 0.05773502691896258 -0.005) // 1
    (-0.05 0.0 -0.005) // 2
    (0.05 -0.05773502691896258 -0.005) // 3
    (0.75 0.05773502691896258 -0.005) // 4
    (0.75 0.2 -0.005) // 5
    (0.75 0.5 -0.005) // 6
    (0.05 0.5 -0.005) // 7
    (-0.05 0.5 -0.005) // 8
    (-0.75 0.5 -0.005) // 9
    (-0.75 0.2 -0.005) // 10
    (-0.75 0 -0.005) // 11
    (-0.75 -0.2 -0.005) // 12
    (-0.75 -0.5 -0.005) // 13
    (-0.05 -0.5 -0.005) // 14
    (0.05 -0.5 -0.005) // 15
    (0.75 -0.5 -0.005) // 16
    (0.75 -0.2 -0.005) // 17
    (0.75 -0.05773502691896258 -0.005) // 18
    (0.05 0.2 -0.005) // 19
    (-0.05 0.2 -0.005) // 20
    (-0.05 -0.2 -0.005) // 21
    (0.05 -0.2 -0.005) // 22
    (0.05 0.0 0.005) // 23
    (0.05 0.05773502691896258 0.005) // 24
    (-0.05 0.0 0.005) // 25
    (0.05 -0.05773502691896258 0.005) // 26
    (0.75 0.05773502691896258 0.005) // 27
    (0.75 0.2 0.005) // 28
    (0.75 0.5 0.005) // 29
    (0.05 0.5 0.005) // 30
    (-0.05 0.5 0.005) // 31
    (-0.75 0.5 0.005) // 32
    (-0.75 0.2 0.005) // 33
    (-0.75 0 0.005) // 34
    (-0.75 -0.2 0.005) // 35
    (-0.75 -0.5 0.005) // 36
    (-0.05 -0.5 0.005) // 37
    (0.05 -0.5 0.005) // 38
    (0.75 -0.5 0.005) // 39
    (0.75 -0.2 0.005) // 40
    (0.75 -0.05773502691896258 0.005) // 41
    (0.05 0.2 0.005) // 42
    (-0.05 0.2 0.005) // 43
    (-0.05 -0.2 0.005) // 44
    (0.05 -0.2 0.005) // 45

);

blocks
(

   // block 0
   hex (3 18 4 1 26 41 27 24) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 1
   hex (1 4 5 19 24 27 28 42) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 2
   hex (2 1 19 20 25 24 42 43)  (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 3
   hex (11 2 20 10 34 25 43 33) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 4
   hex (12 21 2 11 35 44 25 34) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 5
   hex (21 22 3 2 44 45 26 25) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 6
   hex (22 17 18 3 45 40 41 26) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 7
   hex (15 16 17 22 38 39 40 45) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   //block 8
   hex (19 5 6 7 42 28 29 30) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   //block 9
   hex (20 19 7 8 43 42 30 31) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   //block 10
   hex (10 20 8 9 33 43 31 32) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   //block 11
   hex (13 14 21 12 36 37 44 35) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   //block 12
   hex (14 15 22 21 37 38 45 44) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)



);



boundary
(

  inlet
  {
      type patch;
      faces
      (
        (9 32 33 10)
        (10 33 34 11)
        (11 34 35 12)
        (12 35 36 13)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (6 29 28 5)
         (5 28 27 4)
         (4 27 41 18)
         (18 41 40 17)
         (17 40 39 16)
      );
  }

  triangle
  {
      type wall;
      faces
      (
         (2 25 1 24)
         (1 24 26 3)
         (3 26 25 2)

      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
        (9 32 31 8)
        (8 31 30 7)
        (7 30 29 6)

      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (13 36 37 14)
         (14 37 38 15)
         (15 38 39 16)
      );
  }

);
